### This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the [Cookbook](https://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

In [ ]:
import pandas as pd
import numpy as np

# Object Creation
Creating a Series by passing a list of values, letting pandas create a default integer index.
Series is one dimensional(1-D) array defined in pandas that can be used to store any data type.

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
# Creating series of Dictionary type
dictionary ={'a':1, 'b':2, 'c':3, 'd':4, 'e':5}  
s = pd.Series(dictionary)
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
# Creating series of 2darray 
Data =[[2, 3, 4], [5, 6, 7]]  # Defining 2darray 
s = pd.Series(Data)
s

0    [2, 3, 4]
1    [5, 6, 7]
dtype: object

Creating a [DataFrame](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html#pandas.DataFrame) by passing a numpy array, with a datetime index and labeled columns.
DataFrames is two-dimensional(2-D) data structure defined in pandas which consists of rows and columns.

In [ ]:
dates = pd.date_range('20141101', periods=6) #Return a fixed frequency DatetimeIndex.
dates

DatetimeIndex(['2014-11-01', '2014-11-02', '2014-11-03', '2014-11-04',
               '2014-11-05', '2014-11-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=['one','two','three','four'])
df

                 one       two     three      four
2014-11-01 -1.297263  1.686813 -0.414792  0.520120
2014-11-02  0.954013 -0.086838  1.708929  0.833662
2014-11-03 -0.895928 -0.467264  0.709481  0.669820
2014-11-04 -1.044780 -0.140704 -0.708224 -0.010203
2014-11-05  0.230710  0.761445  0.233478  0.067042
2014-11-06  0.801164  0.960269 -0.312377  0.772775

Here, Data can be:

*  One or more dictionaries
*  One or more Series
*  2D-numpy Ndarray

In [ ]:
#When Data is Dictionaries
# Program to Create Data Frame with two dictionaries 
dict1 ={'a':1, 'b':2, 'c':3, 'd':4}        # Define Dictionary 1 
dict2 ={'a':5, 'b':6, 'c':7, 'd':8, 'e':9} # Define Dictionary 2 
Data = {'first':dict1, 'second':dict2}  # Define Data with dict1 and dict2 
dfd = pd.DataFrame(Data)  # Create DataFrame 
dfd

   first  second
a    1.0       5
b    2.0       6
c    3.0       7
d    4.0       8
e    NaN       9

In [ ]:
# When Data is Series
# Program to create Dataframe of three series  
import pandas as pd 
  
s1 = pd.Series([1, 3, 4, 5, 6, 2, 9])           # Define series 1 
s2 = pd.Series([1.1, 3.5, 4.7, 5.8, 2.9, 9.3]) # Define series 2 
s3 = pd.Series(['a', 'b', 'c', 'd', 'e'])     # Define series 3 
  
  
Data ={'first':s1, 'second':s2, 'third':s3} # Define Data 
dfseries = pd.DataFrame(Data)              # Create DataFrame 
dfseries

   first  second third
0      1     1.1     a
1      3     3.5     b
2      4     4.7     c
3      5     5.8     d
4      6     2.9     e
5      2     9.3   NaN
6      9     NaN   NaN

In [ ]:
# When Data is 2D-numpy ndarray
# Program to create DataFrame from 2D array 
import pandas as pd # Import Library 
d1 =[[2, 3, 4], [5, 6, 7]] # Define 2d array 1 
d2 =[[2, 4, 8], [1, 3, 9]] # Define 2d array 2 
Data ={'first': d1, 'second': d2} # Define Data  
df2d = pd.DataFrame(Data)    # Create DataFrame 
df2d

       first     second
0  [2, 3, 4]  [2, 4, 8]
1  [5, 6, 7]  [1, 3, 9]

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [ ]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),     
   ....:                      'E' : 'foo' })
   ....: 
df2

     A          B    C  D    E
0  1.0 2013-01-02  1.0  3  foo
1  1.0 2013-01-02  1.0  3  foo
2  1.0 2013-01-02  1.0  3  foo
3  1.0 2013-01-02  1.0  3  foo

Having specific [dtypes](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes):

In [ ]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
dtype: object


# Viewing Data
See the [Basics section](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics)
See the top & bottom rows of the frame

In [ ]:
df.head()

                 one       two     three      four
2014-11-01  0.085961 -0.343170 -0.696393 -0.722942
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792
2014-11-03  0.730252  1.819466 -1.012443 -0.820563
2014-11-04 -0.086288 -0.764447  0.360375  0.591322
2014-11-05  1.608584  1.965388  0.206775  2.610774

In [ ]:
df.tail(3)

                 one       two     three      four
2014-11-04 -0.086288 -0.764447  0.360375  0.591322
2014-11-05  1.608584  1.965388  0.206775  2.610774
2014-11-06  1.242635 -0.230609 -0.100243  0.566326

Display the index, columns, and the underlying numpy data

In [ ]:
df.index

DatetimeIndex(['2014-11-01', '2014-11-02', '2014-11-03', '2014-11-04',
               '2014-11-05', '2014-11-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [ ]:
df.values

array([[ 0.08596066, -0.34317032, -0.69639293, -0.72294174],
       [ 1.64204739, -0.29215361, -1.5299969 , -0.31979191],
       [ 0.7302521 ,  1.81946595, -1.0124434 , -0.82056313],
       [-0.08628821, -0.7644468 ,  0.36037466,  0.59132173],
       [ 1.60858365,  1.96538805,  0.20677465,  2.61077429],
       [ 1.24263489, -0.23060877, -0.1002435 ,  0.56632578]])

Describe shows a quick statistic summary of your data

In [ ]:
df.describe()

            one       two     three      four
count  6.000000  6.000000  6.000000  6.000000
mean   0.870532  0.359079 -0.461988  0.317521
std    0.752217  1.203350  0.742021  1.279050
min   -0.086288 -0.764447 -1.529997 -0.820563
25%    0.247034 -0.330416 -0.933431 -0.622154
50%    0.986443 -0.261381 -0.398318  0.123267
75%    1.517096  1.306947  0.130020  0.585073
max    1.642047  1.965388  0.360375  2.610774

Transposing your data

In [ ]:
df.T

       2014-11-01  2014-11-02  2014-11-03  2014-11-04  2014-11-05  2014-11-06
one      0.085961    1.642047    0.730252   -0.086288    1.608584    1.242635
two     -0.343170   -0.292154    1.819466   -0.764447    1.965388   -0.230609
three   -0.696393   -1.529997   -1.012443    0.360375    0.206775   -0.100243
four    -0.722942   -0.319792   -0.820563    0.591322    2.610774    0.566326

Sorting by an axis (In this case, sorting the columns in reverse alphabetical order):

In [ ]:
df.sort_index(axis=1, ascending=False)

                 two     three       one      four
2014-11-01 -0.343170 -0.696393  0.085961 -0.722942
2014-11-02 -0.292154 -1.529997  1.642047 -0.319792
2014-11-03  1.819466 -1.012443  0.730252 -0.820563
2014-11-04 -0.764447  0.360375 -0.086288  0.591322
2014-11-05  1.965388  0.206775  1.608584  2.610774
2014-11-06 -0.230609 -0.100243  1.242635  0.566326

Sorting by values

In [ ]:
df.sort_values(by='two')

                 one       two     three      four
2014-11-04 -0.086288 -0.764447  0.360375  0.591322
2014-11-01  0.085961 -0.343170 -0.696393 -0.722942
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792
2014-11-06  1.242635 -0.230609 -0.100243  0.566326
2014-11-03  0.730252  1.819466 -1.012443 -0.820563
2014-11-05  1.608584  1.965388  0.206775  2.610774

# Reading and Viewing CSV dataframes

In [ ]:
# from google.colab import drive
# drive.mount('/content/drive')

In [ ]:
# dfcsv = pd.read_csv('/content/drive/My Drive/melb_data.csv')
# dfcsv

In [ ]:
# dfcsv.head(10)

In [ ]:
# dfcsv.tail(10)

In [ ]:
# dfcsv.describe()

# Selection

Note While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.
See the indexing documentation [Indexing and Selecting Data](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

## Getting

Selecting a single column, which yields a Series, equivalent to df.one

In [ ]:
df['one']

2014-11-01    0.085961
2014-11-02    1.642047
2014-11-03    0.730252
2014-11-04   -0.086288
2014-11-05    1.608584
2014-11-06    1.242635
Freq: D, Name: one, dtype: float64

In [ ]:
df.one

2014-11-01    0.085961
2014-11-02    1.642047
2014-11-03    0.730252
2014-11-04   -0.086288
2014-11-05    1.608584
2014-11-06    1.242635
Freq: D, Name: one, dtype: float64

Selecting via [], which slices the rows.

In [ ]:
df[0:3]

                 one       two     three      four
2014-11-01  0.085961 -0.343170 -0.696393 -0.722942
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792
2014-11-03  0.730252  1.819466 -1.012443 -0.820563

In [ ]:
df['20141102':'20141104']

                 one       two     three      four
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792
2014-11-03  0.730252  1.819466 -1.012443 -0.820563
2014-11-04 -0.086288 -0.764447  0.360375  0.591322

## Selecting by Label

See more in[ Selection by Label](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label)

For getting a cross section using a label

In [ ]:
df.loc[dates[0]]

one      0.085961
two     -0.343170
three   -0.696393
four    -0.722942
Name: 2014-11-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [ ]:
df.loc[:,['one','two']]

                 one       two
2014-11-01  0.085961 -0.343170
2014-11-02  1.642047 -0.292154
2014-11-03  0.730252  1.819466
2014-11-04 -0.086288 -0.764447
2014-11-05  1.608584  1.965388
2014-11-06  1.242635 -0.230609

Showing label slicing, both endpoints are included

In [ ]:
df.loc['20141102':'20141104',['one','two']]

                 one       two
2014-11-02  1.642047 -0.292154
2014-11-03  0.730252  1.819466
2014-11-04 -0.086288 -0.764447

Reduction in the dimensions of the returned object

In [ ]:
df.loc['20141102',['one','two']]

one    1.642047
two   -0.292154
Name: 2014-11-02 00:00:00, dtype: float64

For getting a scalar value

In [ ]:
df.loc[dates[0],'one']

0.08596066164407934

For getting fast access to a scalar (equiv to the prior method)

In [ ]:
df.at[dates[0],'one']

0.08596066164407934

## Selection by Position

See more in [Selection by Position](Selection by Position)

Select via the position of the passed integers

In [ ]:
df.iloc[3]

one     -0.086288
two     -0.764447
three    0.360375
four     0.591322
Name: 2014-11-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

By lists of integer position locations, similar to the numpy/python style

In [ ]:
df.iloc[[1,2,4],[0,2]]

                 one     three
2014-11-02  1.642047 -1.529997
2014-11-03  0.730252 -1.012443
2014-11-05  1.608584  0.206775

For slicing rows explicitly

In [ ]:
df.iloc[1:3,:] #note here 3rd index in not included in this slicing

                 one       two     three      four
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792
2014-11-03  0.730252  1.819466 -1.012443 -0.820563

For slicing columns explicitly

In [ ]:
df.iloc[:,1:3]

                 two     three
2014-11-01 -0.343170 -0.696393
2014-11-02 -0.292154 -1.529997
2014-11-03  1.819466 -1.012443
2014-11-04 -0.764447  0.360375
2014-11-05  1.965388  0.206775
2014-11-06 -0.230609 -0.100243

For getting a value explicitly

In [ ]:
df.iloc[1,1]

-0.29215360707838567

For getting fast access to a scalar (equiv to the prior method)

In [ ]:
df.iat[0,0]

0.08596066164407934

## Boolean Indexing
Using a single columns values to select data.

In [ ]:
df[df.one > 0.5]

                 one       two     three      four
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792
2014-11-03  0.730252  1.819466 -1.012443 -0.820563
2014-11-05  1.608584  1.965388  0.206775  2.610774
2014-11-06  1.242635 -0.230609 -0.100243  0.566326

Selecting values from a DataFrame where a boolean condition is met.

In [ ]:
df[df>0]

                 one       two     three      four
2014-11-01  0.085961       NaN       NaN       NaN
2014-11-02  1.642047       NaN       NaN       NaN
2014-11-03  0.730252  1.819466       NaN       NaN
2014-11-04       NaN       NaN  0.360375  0.591322
2014-11-05  1.608584  1.965388  0.206775  2.610774
2014-11-06  1.242635       NaN       NaN  0.566326

Using the isin method for filtering:

In [ ]:
df2 = df.copy()
df2['five'] = ['one', 'one','two','three','four','three']
df2

                 one       two     three      four   five
2014-11-01  0.085961 -0.343170 -0.696393 -0.722942    one
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792    one
2014-11-03  0.730252  1.819466 -1.012443 -0.820563    two
2014-11-04 -0.086288 -0.764447  0.360375  0.591322  three
2014-11-05  1.608584  1.965388  0.206775  2.610774   four
2014-11-06  1.242635 -0.230609 -0.100243  0.566326  three

In [ ]:
df2[df2['five'].isin(['two','four'])]

                 one       two     three      four  five
2014-11-03  0.730252  1.819466 -1.012443 -0.820563   two
2014-11-05  1.608584  1.965388  0.206775  2.610774  four

## Setting
Setting a new column automatically aligns the data by the indexes

In [ ]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20141101', periods=6))
s1

2014-11-01    1
2014-11-02    2
2014-11-03    3
2014-11-04    4
2014-11-05    5
2014-11-06    6
Freq: D, dtype: int64

In [ ]:
df['six'] = s1
df

                 one       two     three      four  six
2014-11-01  0.085961 -0.343170 -0.696393 -0.722942    1
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792    2
2014-11-03  0.730252  1.819466 -1.012443 -0.820563    3
2014-11-04 -0.086288 -0.764447  0.360375  0.591322    4
2014-11-05  1.608584  1.965388  0.206775  2.610774    5
2014-11-06  1.242635 -0.230609 -0.100243  0.566326    6

Setting values by label:

In [ ]:
df.at[dates[0],'one'] = 0
df

                 one       two     three      four  six
2014-11-01  0.000000 -0.343170 -0.696393 -0.722942    1
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792    2
2014-11-03  0.730252  1.819466 -1.012443 -0.820563    3
2014-11-04 -0.086288 -0.764447  0.360375  0.591322    4
2014-11-05  1.608584  1.965388  0.206775  2.610774    5
2014-11-06  1.242635 -0.230609 -0.100243  0.566326    6

Setting values by position:

In [ ]:
df.iat[0,1] = 0
df

                 one       two     three      four  six
2014-11-01  0.000000  0.000000 -0.696393 -0.722942    1
2014-11-02  1.642047 -0.292154 -1.529997 -0.319792    2
2014-11-03  0.730252  1.819466 -1.012443 -0.820563    3
2014-11-04 -0.086288 -0.764447  0.360375  0.591322    4
2014-11-05  1.608584  1.965388  0.206775  2.610774    5
2014-11-06  1.242635 -0.230609 -0.100243  0.566326    6

In [ ]:
df.loc[:,'four'] = np.array([5] * len(df))
df

                 one       two     three  four  six
2014-11-01  0.000000  0.000000 -0.696393     5    1
2014-11-02  1.642047 -0.292154 -1.529997     5    2
2014-11-03  0.730252  1.819466 -1.012443     5    3
2014-11-04 -0.086288 -0.764447  0.360375     5    4
2014-11-05  1.608584  1.965388  0.206775     5    5
2014-11-06  1.242635 -0.230609 -0.100243     5    6

A where operation with setting.

In [ ]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                 one       two     three  four  six
2014-11-01  0.000000  0.000000 -0.696393    -5   -1
2014-11-02 -1.642047 -0.292154 -1.529997    -5   -2
2014-11-03 -0.730252 -1.819466 -1.012443    -5   -3
2014-11-04 -0.086288 -0.764447 -0.360375    -5   -4
2014-11-05 -1.608584 -1.965388 -0.206775    -5   -5
2014-11-06 -1.242635 -0.230609 -0.100243    -5   -6

# Missing Data
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the [Missing Data section](https://pandas.pydata.org/pandas-docs/stable/missing_data.html#missing-data)

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [ ]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                 one       two     three  four  six    E
2014-11-01  0.000000  0.000000 -0.696393     5    1  1.0
2014-11-02  1.642047 -0.292154 -1.529997     5    2  1.0
2014-11-03  0.730252  1.819466 -1.012443     5    3  NaN
2014-11-04 -0.086288 -0.764447  0.360375     5    4  NaN

To drop any rows that have missing data:

In [ ]:
df1.dropna(how='any')

                 one       two     three  four  six    E
2014-11-01  0.000000  0.000000 -0.696393     5    1  1.0
2014-11-02  1.642047 -0.292154 -1.529997     5    2  1.0

Filling missing data:

In [ ]:
df1.fillna(value=5)

                 one       two     three  four  six    E
2014-11-01  0.000000  0.000000 -0.696393     5    1  1.0
2014-11-02  1.642047 -0.292154 -1.529997     5    2  1.0
2014-11-03  0.730252  1.819466 -1.012443     5    3  5.0
2014-11-04 -0.086288 -0.764447  0.360375     5    4  5.0

# Operations
See the [Basic section on Binary Ops](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

### Stats
Operations in general *exclude* missing data.

Performing a descriptive statistic:

In [ ]:
df.mean()

one      0.856205
two      0.416274
three   -0.461988
four     5.000000
six      3.500000
dtype: float64

Same operation on the other axis:

In [ ]:
df.mean(1)

2014-11-01    1.060721
2014-11-02    1.363979
2014-11-03    1.907455
2014-11-04    1.701928
2014-11-05    2.756149
2014-11-06    2.382357
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension. The following code also shifts the data vertically, leaving NaN values in the unoccupied spaces

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2014-11-01    NaN
2014-11-02    NaN
2014-11-03    1.0
2014-11-04    3.0
2014-11-05    5.0
2014-11-06    NaN
Freq: D, dtype: float64

In [ ]:
df.sub(s, axis='index')

                 one       two     three  four  six
2014-11-01       NaN       NaN       NaN   NaN  NaN
2014-11-02       NaN       NaN       NaN   NaN  NaN
2014-11-03 -0.269748  0.819466 -2.012443   4.0  2.0
2014-11-04 -3.086288 -3.764447 -2.639625   2.0  1.0
2014-11-05 -3.391416 -3.034612 -4.793225   0.0  0.0
2014-11-06       NaN       NaN       NaN   NaN  NaN

### Apply
Applying functions to the data

In [ ]:
df.apply(np.cumsum)

                 one       two     three  four  six
2014-11-01  0.000000  0.000000 -0.696393     5    1
2014-11-02  1.642047 -0.292154 -2.226390    10    3
2014-11-03  2.372299  1.527312 -3.238833    15    6
2014-11-04  2.286011  0.762866 -2.878459    20   10
2014-11-05  3.894595  2.728254 -2.671684    25   15
2014-11-06  5.137230  2.497645 -2.771927    30   21

### Histogramming 
See more at [Histogramming and Discretization](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [ ]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    6
2    4
3    2
4    5
5    1
6    0
7    1
8    2
9    2
dtype: int64

In [ ]:
s.value_counts()

2    3
5    2
1    2
6    1
4    1
0    1
dtype: int64

### String Methods
Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](https://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [ ]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [ ]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge
### Concat
pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with [concat()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html#pandas.concat):

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.265052 -0.449757  0.351896 -0.719119
1 -1.054437  0.136655 -2.558055 -0.760978
2  0.772715  1.705808  0.030674  0.788539
3 -0.068389 -0.484476 -1.225928 -0.019869
4 -0.347486 -0.230189  1.218101  0.319452
5  1.621663  0.580814  0.108741 -0.035348
6 -0.314589  0.259669  1.145723 -1.721211
7 -0.789369 -0.148200  0.806398  0.085250
8 -0.270345  0.524874  0.047428  0.175279
9 -0.552688  0.341453 -0.658800 -1.223489

In [ ]:
#break it into pieces:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.265052 -0.449757  0.351896 -0.719119
 1 -1.054437  0.136655 -2.558055 -0.760978
 2  0.772715  1.705808  0.030674  0.788539,
           0         1         2         3
 3 -0.068389 -0.484476 -1.225928 -0.019869
 4 -0.347486 -0.230189  1.218101  0.319452
 5  1.621663  0.580814  0.108741 -0.035348
 6 -0.314589  0.259669  1.145723 -1.721211,
           0         1         2         3
 7 -0.789369 -0.148200  0.806398  0.085250
 8 -0.270345  0.524874  0.047428  0.175279
 9 -0.552688  0.341453 -0.658800 -1.223489]

In [ ]:
pd.concat(pieces)

          0         1         2         3
0  0.265052 -0.449757  0.351896 -0.719119
1 -1.054437  0.136655 -2.558055 -0.760978
2  0.772715  1.705808  0.030674  0.788539
3 -0.068389 -0.484476 -1.225928 -0.019869
4 -0.347486 -0.230189  1.218101  0.319452
5  1.621663  0.580814  0.108741 -0.035348
6 -0.314589  0.259669  1.145723 -1.721211
7 -0.789369 -0.148200  0.806398  0.085250
8 -0.270345  0.524874  0.047428  0.175279
9 -0.552688  0.341453 -0.658800 -1.223489

### Join

SQL style merges. See the [Database style joining](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [ ]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [ ]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [ ]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Another example that can be given is:

In [ ]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [ ]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [ ]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append
Append rows to a dataframe. See the [Appending](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.721953 -0.173420 -2.713010 -0.581023
1 -0.217473  0.866881 -0.690782 -0.609228
2 -1.657866 -0.603206  1.350442 -0.554987
3  0.668721 -1.648515 -0.946648  0.063837
4 -0.508451 -2.397828 -1.309726 -1.119255
5  0.428960  0.052848 -1.705780 -0.344784
6  0.555210  0.562284  1.135504  0.277639
7  0.575028 -0.023479 -0.511452 -0.454951

In [ ]:
s = df.iloc[3]
s

A    0.668721
B   -1.648515
C   -0.946648
D    0.063837
Name: 3, dtype: float64

In [ ]:
df.append(s,ignore_index=True)

          A         B         C         D
0 -0.721953 -0.173420 -2.713010 -0.581023
1 -0.217473  0.866881 -0.690782 -0.609228
2 -1.657866 -0.603206  1.350442 -0.554987
3  0.668721 -1.648515 -0.946648  0.063837
4 -0.508451 -2.397828 -1.309726 -1.119255
5  0.428960  0.052848 -1.705780 -0.344784
6  0.555210  0.562284  1.135504  0.277639
7  0.575028 -0.023479 -0.511452 -0.454951
8  0.668721 -1.648515 -0.946648  0.063837

# Grouping
By group by we are referring to a process involving one or more of the following steps

Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

See the [Grouping section](https://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.382216  0.761429
1  bar    one -0.800680  0.626529
2  foo    two  0.636774 -0.662475
3  bar  three -1.011011 -0.228146
4  foo    two  0.601819  1.201345
5  bar    two  0.788677 -1.824030
6  foo    one -0.119961  0.176299
7  foo  three -0.852712  0.552242

Grouping and then applying a function sum to the resulting groups.

In [ ]:
df.groupby('A').sum()

            C         D
A
bar -1.023015 -1.425647
foo -1.116297  2.028841

Grouping by multiple columns forms a hierarchical index, which we then apply the function.

In [ ]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.800680  0.626529
    three -1.011011 -0.228146
    two    0.788677 -1.824030
foo one   -1.502177  0.937728
    three -0.852712  0.552242
    two    1.238593  0.538871

# Reshaping
See the sections on [Hierarchical Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

### Stack

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     0.831226  0.632002
      two     0.098756  1.818326
baz   one    -0.827231  0.797553
      two    -1.382855  0.027145
foo   one     0.776752  0.593226
      two    -0.759354  0.162525
qux   one     1.269812 -2.445740
      two     0.455118  0.496215

The [stack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) method compresses a level in the DataFrames columns.

In [ ]:
stacked = df.stack()
stacked

first  second
bar    one     A    0.831226
               B    0.632002
       two     A    0.098756
               B    1.818326
baz    one     A   -0.827231
               B    0.797553
       two     A   -1.382855
               B    0.027145
foo    one     A    0.776752
               B    0.593226
       two     A   -0.759354
               B    0.162525
qux    one     A    1.269812
               B   -2.445740
       two     A    0.455118
               B    0.496215
dtype: float64

With a stacked DataFrame or Series (having a MultiIndex as the index), the inverse operation of [stack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) is [unstack()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.unstack.html#pandas.DataFrame.unstack), which by default unstacks the last level:

In [ ]:
stacked.unstack()

                     A         B
first second
bar   one     0.831226  0.632002
      two     0.098756  1.818326
baz   one    -0.827231  0.797553
      two    -1.382855  0.027145
foo   one     0.776752  0.593226
      two    -0.759354  0.162525
qux   one     1.269812 -2.445740
      two     0.455118  0.496215

### Pivot Tables
See the section on [Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.746410  1.337380
1     one  B  foo -0.156760  0.739167
2     two  C  foo  0.226451  0.188624
3   three  A  bar -0.405780 -1.230433
4     one  B  bar -0.367119  0.560755
5     one  C  bar  0.868534  0.648559
6     two  A  foo -0.600066  1.742371
7   three  B  foo -1.293026  1.025609
8     one  C  foo -0.167812 -0.529573
9     one  A  bar  1.985292  1.634847
10    two  B  bar -1.530456  1.751804
11  three  C  bar -0.395814 -0.092341

We can produce pivot tables from this data very easily:

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.985292  0.746410
      B -0.367119 -0.156760
      C  0.868534 -0.167812
three A -0.405780       NaN
      B       NaN -1.293026
      C -0.395814       NaN
two   A       NaN -0.600066
      B -1.530456       NaN
      C       NaN  0.226451

# Getting Data In/Out
### CSV
[Writing to a csv file](https://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv).

In [ ]:
df.to_csv('foo.csv')

In [ ]:
pd.read_csv('foo.csv')

    Unnamed: 0      A  B    C         D         E
0            0    one  A  foo  0.746410  1.337380
1            1    one  B  foo -0.156760  0.739167
2            2    two  C  foo  0.226451  0.188624
3            3  three  A  bar -0.405780 -1.230433
4            4    one  B  bar -0.367119  0.560755
5            5    one  C  bar  0.868534  0.648559
6            6    two  A  foo -0.600066  1.742371
7            7  three  B  foo -1.293026  1.025609
8            8    one  C  foo -0.167812 -0.529573
9            9    one  A  bar  1.985292  1.634847
10          10    two  B  bar -1.530456  1.751804
11          11  three  C  bar -0.395814 -0.092341

### Excel
Reading and writing to [MS Excel](https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel).

Writing to an excel file:

In [ ]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file:

In [ ]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

    Unnamed: 0      A  B    C         D         E
0            0    one  A  foo  0.746410  1.337380
1            1    one  B  foo -0.156760  0.739167
2            2    two  C  foo  0.226451  0.188624
3            3  three  A  bar -0.405780 -1.230433
4            4    one  B  bar -0.367119  0.560755
5            5    one  C  bar  0.868534  0.648559
6            6    two  A  foo -0.600066  1.742371
7            7  three  B  foo -1.293026  1.025609
8            8    one  C  foo -0.167812 -0.529573
9            9    one  A  bar  1.985292  1.634847
10          10    two  B  bar -1.530456  1.751804
11          11  three  C  bar -0.395814 -0.092341